In [1]:
%load_ext sql

# put a folder and DB credential files at HOME directory

import os
homedir = os.getcwd()
cred_path = os.path.join(homedir, 'db_cred')



# add a 'cred_path' for interpreter to search
import sys
sys.path.append(cred_path)



# import DB credentials from 'gpdb_credentials.py' dictionary file.
from gpdb_credentials import dvdrental_db



# parsing DB credentials and connect to Greenplum using %sql $connection_string

username = dvdrental_db['Username']
password = dvdrental_db['Password']
host = dvdrental_db['Host']
port = dvdrental_db['Port']
database = dvdrental_db['Database']

connection_string = 'postgresql://{user}:{password}@{host}:{port}/{db}'.format(
user=username,
password=password,
host=host,
port=port,
db=database)

%sql $connection_string

'Connected: myuser@dvdrental'

# 문제 1
>문제1번 
고객의 기본 정보인, 고객 id, 이름, 성, 이메일과 함께 고객의 주소 address, district, postal_code, phone 번호를 함께 출력하시오. 

- 고객 id, 이름, 성, 이메일 에 대한 데이터는 CUSTOMER 테이블에 있다.
- 고객의 주소 address, district, postal_code, phone 번호 에 대한 정보는 ADDRESS 테이블에 있다.
- 두 테이블에 공통으로 존재하는 컬럼은 ADDRESS_ID 컬럼이다.

INNER JOIN으로 풀기(1)

In [2]:
%%sql

SELECT
    A.CUSTOMER_ID, A.LAST_NAME||' '||A.FIRST_NAME AS FULL_NAME,
    A.EMAIL, B.ADDRESS,
    B.DISTRICT, B.POSTAL_CODE,
    B.PHONE
FROM CUSTOMER A
INNER JOIN 
    ADDRESS B
ON (A.ADDRESS_ID = B.ADDRESS_ID) -- 두 테이블 사이의 공통 컬럼
LIMIT 5;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[(1, 'Smith Mary', 'mary.smith@sakilacustomer.org', '1913 Hanoi Way', 'Nagasaki', '35200', '28303384290'),
 (2, 'Johnson Patricia', 'patricia.johnson@sakilacustomer.org', '1121 Loja Avenue', 'California', '17886', '838635286649'),
 (3, 'Williams Linda', 'linda.williams@sakilacustomer.org', '692 Joliet Street', 'Attika', '83579', '448477190408'),
 (4, 'Jones Barbara', 'barbara.jones@sakilacustomer.org', '1566 Inegl Manor', 'Mandalay', '53561', '705814003527'),
 (5, 'Brown Elizabeth', 'elizabeth.brown@sakilacustomer.org', '53 Idfu Parkway', 'Nantou', '42399', '10655648674')]

INNER JOIN으로 풀기(2)
 - INNER JOIN은 JOIN 만 입력했을 경우에도 적용된다.

In [3]:
%%sql

SELECT
    A.CUSTOMER_ID, A.LAST_NAME||' '||A.FIRST_NAME AS FULL_NAME,
    A.EMAIL, B.ADDRESS,
    B.DISTRICT, B.POSTAL_CODE,
    B.PHONE
FROM CUSTOMER A 
JOIN 
    ADDRESS B
ON (A.ADDRESS_ID = B.ADDRESS_ID) -- 두 테이블 사이의 공통 컬럼
LIMIT 5;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[(1, 'Smith Mary', 'mary.smith@sakilacustomer.org', '1913 Hanoi Way', 'Nagasaki', '35200', '28303384290'),
 (2, 'Johnson Patricia', 'patricia.johnson@sakilacustomer.org', '1121 Loja Avenue', 'California', '17886', '838635286649'),
 (3, 'Williams Linda', 'linda.williams@sakilacustomer.org', '692 Joliet Street', 'Attika', '83579', '448477190408'),
 (4, 'Jones Barbara', 'barbara.jones@sakilacustomer.org', '1566 Inegl Manor', 'Mandalay', '53561', '705814003527'),
 (5, 'Brown Elizabeth', 'elizabeth.brown@sakilacustomer.org', '53 Idfu Parkway', 'Nantou', '42399', '10655648674')]

WHERE 절에 조건 부여해서 풀기

In [4]:
%%sql

SELECT
    A.CUSTOMER_ID, A.LAST_NAME||' '||A.FIRST_NAME AS FULL_NAME,
    A.EMAIL, B.ADDRESS,
    B.DISTRICT, B.POSTAL_CODE,
    B.PHONE
FROM CUSTOMER A, ADDRESS B
WHERE A.ADDRESS_ID = B.ADDRESS_ID -- 두 테이블 사이의 공통 컬럼
LIMIT 5;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[(1, 'Smith Mary', 'mary.smith@sakilacustomer.org', '1913 Hanoi Way', 'Nagasaki', '35200', '28303384290'),
 (2, 'Johnson Patricia', 'patricia.johnson@sakilacustomer.org', '1121 Loja Avenue', 'California', '17886', '838635286649'),
 (3, 'Williams Linda', 'linda.williams@sakilacustomer.org', '692 Joliet Street', 'Attika', '83579', '448477190408'),
 (4, 'Jones Barbara', 'barbara.jones@sakilacustomer.org', '1566 Inegl Manor', 'Mandalay', '53561', '705814003527'),
 (5, 'Brown Elizabeth', 'elizabeth.brown@sakilacustomer.org', '53 Idfu Parkway', 'Nantou', '42399', '10655648674')]

# 문제 2.	
>문제2번
고객의  기본 정보인, 고객 id, 이름, 성, 이메일과 함께 고객의 주소 address, district, postal_code, phone , city 를 함께 출력하시오. 	

- 고객 id, 이름, 성, 이메일 에 대한 데이터는 CUSTOMER 테이블에 있다.
- 고객의 주소 address, district, postal_code, phone 번호 에 대한 정보는 ADDRESS 테이블에 있다.
- city 에 대한 정보는 CITY 테이블에 있다.
- CUSTOMER 테이블과 ADDRESS 테이블에 공통으로 존재하는 컬럼은 ADDRESS_ID 컬럼이다.
- ADDRESS 테이블과 CITY 테이블에 공통으로 존재하는 컬럼은 CITY_ID 이다.

INNER JOIN으로 풀기

In [5]:
%%sql

SELECT
    A.CUSTOMER_ID, A.LAST_NAME||' '||A.FIRST_NAME AS FULL_NAME,
    A.EMAIL, B.ADDRESS,
    B.DISTRICT, B.POSTAL_CODE,
    B.PHONE, C.CITY
FROM 
        CUSTOMER A
INNER JOIN 
        ADDRESS B ON (A.ADDRESS_ID = B.ADDRESS_ID)
INNER JOIN
        CITY C ON (B.CITY_ID = C.CITY_ID)
LIMIT 5;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[(1, 'Smith Mary', 'mary.smith@sakilacustomer.org', '1913 Hanoi Way', 'Nagasaki', '35200', '28303384290', 'Sasebo'),
 (2, 'Johnson Patricia', 'patricia.johnson@sakilacustomer.org', '1121 Loja Avenue', 'California', '17886', '838635286649', 'San Bernardino'),
 (3, 'Williams Linda', 'linda.williams@sakilacustomer.org', '692 Joliet Street', 'Attika', '83579', '448477190408', 'Athenai'),
 (4, 'Jones Barbara', 'barbara.jones@sakilacustomer.org', '1566 Inegl Manor', 'Mandalay', '53561', '705814003527', 'Myingyan'),
 (5, 'Brown Elizabeth', 'elizabeth.brown@sakilacustomer.org', '53 Idfu Parkway', 'Nantou', '42399', '10655648674', 'Nantou')]

WHERE 절에 조건 부여해서 풀기

In [6]:
%%sql

SELECT
    A.CUSTOMER_ID, A.LAST_NAME||' '||A.FIRST_NAME AS FULL_NAME,
    A.EMAIL, B.ADDRESS,
    B.DISTRICT, B.POSTAL_CODE,
    B.PHONE, C.CITY
FROM CUSTOMER A, ADDRESS B, CITY C
WHERE A.ADDRESS_ID = B.ADDRESS_ID
AND
    B.CITY_ID = C.CITY_ID
    LIMIT 5;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[(1, 'Smith Mary', 'mary.smith@sakilacustomer.org', '1913 Hanoi Way', 'Nagasaki', '35200', '28303384290', 'Sasebo'),
 (2, 'Johnson Patricia', 'patricia.johnson@sakilacustomer.org', '1121 Loja Avenue', 'California', '17886', '838635286649', 'San Bernardino'),
 (3, 'Williams Linda', 'linda.williams@sakilacustomer.org', '692 Joliet Street', 'Attika', '83579', '448477190408', 'Athenai'),
 (4, 'Jones Barbara', 'barbara.jones@sakilacustomer.org', '1566 Inegl Manor', 'Mandalay', '53561', '705814003527', 'Myingyan'),
 (5, 'Brown Elizabeth', 'elizabeth.brown@sakilacustomer.org', '53 Idfu Parkway', 'Nantou', '42399', '10655648674', 'Nantou')]

# 문제 3.
>문제3번
Lima City에 사는 고객의 이름과, 성, 이메일, phonenumber에 대해서 출력하시오.

INNER JOIN 으로 풀기

- where 절은 항상 from절 뒤에 온다.
    - inner절은 항상 from절 뒤에 온다.
    - from절과 inner절은 데이터를 불러오는 하나의 절이라 인식하는 것이 좋다.
- where 절에 '='을 쓰지 않은 이유:
    - 혹시라도 Lima가 아닌 여러 CITY 컬럼의 값을 동시에 검색하고자 할때 (즉, 코드가 추가되거나 city 조건이 추가될때 수정이 용이) 관리하기 유용하기 때문

In [7]:
%%sql

SELECT 
	A.CUSTOMER_ID,
	A.LAST_NAME || ' ' || A.FIRST_NAME as NAME,
	A.EMAIL,
	B.PHONE,
	C.CITY
FROM
	CUSTOMER A
JOIN ADDRESS B
ON
	A.ADDRESS_ID = B.ADDRESS_ID
JOIN CITY C
ON
	B.CITY_ID = C.CITY_ID
	WHERE
	C.CITY in ('Lima');

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
1 rows affected.

[(122, 'Murray Thelma', 'thelma.murray@sakilacustomer.org', '937222955822', 'Lima')]

3-1 )Lima City와 Bhopal, New York 에 사는 고객의 이름과, 성, 이메일, phonenumber에 대해서 출력하시오.

In [8]:
%%sql

SELECT 
	A.CUSTOMER_ID,
	A.LAST_NAME || ' ' || A.FIRST_NAME as NAME,
	A.EMAIL,
	B.PHONE,
	C.CITY
FROM
	CUSTOMER A
JOIN ADDRESS B
ON
	A.ADDRESS_ID = B.ADDRESS_ID
JOIN CITY C
ON
	B.CITY_ID = C.CITY_ID
	WHERE
	C.CITY in ('Lima','Bhopal', 'New Yokr');

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
2 rows affected.

[(15, 'Harris Helen', 'helen.harris@sakilacustomer.org', '990911107354', 'Bhopal'),
 (122, 'Murray Thelma', 'thelma.murray@sakilacustomer.org', '937222955822', 'Lima')]

- New York 이란 도시명이 데이터에 없어서 출력되지 않는 듯 하다.

3-2) 데이터 셋에 New York 이란 도시가 없는 것인지 확인하시오.

In [9]:
%%sql

SELECT
	*
FROM
	CITY
WHERE
	CITY LIKE 'New%';

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
1 rows affected.

[(364, 'Newcastle', 85, datetime.datetime(2006, 2, 15, 9, 45, 25))]

위의 3-1 에서 결과 값이 2개인 이유는 New York이 데이터에 없기 때문이다.

# 문제 4.
>문제4번
rental 정보에 추가로, 고객의 이름과, 직원의 이름을 함께 출력하시오.
(고객의 이름, 직원 이름은 이름과 성을  fullname 컬럼으로만들어서 직원이름/고객이름 2개의 컬럼으로 출력하시오.)

- rental 에 고객에 대한 정보는 customer_id 뿐이다.
- 고객 명이 있는 테이블은 customer, 직원명이 있는 테이블은 staff 이다.
- full name을 만드는 것은 '|| ||' 을 활용한다.

In [10]:
%%sql

SELECT
	R.* , -- RENTAL 테이블의 모든 컬럼 출력
	C.LAST_NAME || ' ' || C.FIRST_NAME AS CUSTOMER_NAME, -- 고객명
	S.LAST_NAME || ' ' || S.FIRST_NAME AS STAFF_NAME -- 직원명
FROM
	RENTAL R
JOIN CUSTOMER C 	
ON
	R.CUSTOMER_ID = C.CUSTOMER_ID
JOIN STAFF S 
ON
	R.STAFF_ID = S.STAFF_ID
LIMIT 5;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[(2, datetime.datetime(2005, 5, 24, 22, 54, 33), 1525, 459, datetime.datetime(2005, 5, 28, 19, 40, 33), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Collazo Tommy', 'Hillyer Mike'),
 (3, datetime.datetime(2005, 5, 24, 23, 3, 39), 1711, 408, datetime.datetime(2005, 6, 1, 22, 12, 39), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Murrell Manuel', 'Hillyer Mike'),
 (4, datetime.datetime(2005, 5, 24, 23, 4, 41), 2452, 333, datetime.datetime(2005, 6, 3, 1, 43, 41), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Purdy Andrew', 'Stephens Jon'),
 (5, datetime.datetime(2005, 5, 24, 23, 5, 21), 2079, 222, datetime.datetime(2005, 6, 2, 4, 33, 21), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Hansen Delores', 'Hillyer Mike'),
 (6, datetime.datetime(2005, 5, 24, 23, 8, 7), 2792, 549, datetime.datetime(2005, 5, 27, 1, 32, 7), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Christenson Nelson', 'Hillyer Mike')]

# 문제 5.
>문제5번 seth.hannon@sakilacustomer.org 이메일 주소를 가진 고객의  주소 address, address2, postal_code, phone, city 주소를 출력하시오.	

- 고객 이메일주소는 customer 테이블에 있다.
- address, address2, postal_code, phone 는 address 테이블에 있다.
- city 는 city 테이블에 있다.

In [11]:
%%sql

SELECT
	C.EMAIL,
	A.ADDRESS,
	A.ADDRESS2,
	A.POSTAL_CODE,
	A.PHONE,
	CT.CITY
FROM
	CUSTOMER C
JOIN ADDRESS A
ON
	C.ADDRESS_ID = A.ADDRESS_ID
JOIN CITY CT
ON
	A.CITY_ID = CT.CITY_ID
WHERE
	C.EMAIL = 'seth.hannon@sakilacustomer.org';

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
1 rows affected.

[('seth.hannon@sakilacustomer.org', '1759 Niznekamsk Avenue', '', '39414', '864392582257', 'al-Manama')]

# 문제 6.
>문제6번 Jon Stephens 직원을 통해 dvd대여를 한 payment 기록 정보를  확인하려고 합니다. 
(payment_id,  고객 이름 과 성,  rental_id, amount, staff 이름과 성을 출력하시오.) 	

- 직원 이름은 staff 테이블에 있다.
- payment_id, rental_id, amount는 payment 테이블에 있다.
- 고객 이름은 customer 테이블에 있다.
- customer 테이블은 customer_id로 payment와 join할 수 있다.
- pyament 테이블은 staff_id로 staff 와 join 할 수 있다.

In [12]:
%%sql


SELECT 
	P.PAYMENT_ID,
	P.RENTAL_ID,
	P.AMOUNT,
	C.FIRST_NAME ||' '|| C.LAST_NAME AS CUSTOMER_NAME,
	S.FIRST_NAME ||' '|| S.LAST_NAME AS STAFF_NAME
FROM
	PAYMENT P
JOIN CUSTOMER C 
ON
	P.CUSTOMER_ID = C.CUSTOMER_ID
JOIN STAFF S 
ON
	P.STAFF_ID = S.STAFF_ID
WHERE
		S.FIRST_NAME ||' '|| S.LAST_NAME = 'Jon Stephens'
LIMIT 5;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[(18203, 1651, Decimal('4.99'), 'Jared Ely', 'Jon Stephens'),
 (18204, 3454, Decimal('2.99'), 'Jared Ely', 'Jon Stephens'),
 (21950, 13626, Decimal('2.99'), 'Jared Ely', 'Jon Stephens'),
 (21951, 14046, Decimal('4.99'), 'Jared Ely', 'Jon Stephens'),
 (21954, 14680, Decimal('1.99'), 'Jared Ely', 'Jon Stephens')]

# 문제 7.
>문제7번 배우가 출연하지 않는 영화의 film_id, title, release_year, rental_rate, length 를 출력하시오. 	

- film_id, title, release_year, rental_rate, length 는 film테이블에 있다.
- 배우에 대한 정보는 actor 테이블에 있다.
- actor와 film 테이블은 last_update 컬럼외에 공통 컬럼이 없다.
    - last_update 컬럼은 timestamp 형식이라 두 컬럼간 inner join이 가능한 컬럼이 있을 가능성은 매우 낮다.
- film과 actor의 정보를 모두 가진 film_actor 테이블을 통해 join이 가능하다.
- film_actor와 film 사이의 left outer join 한 테이블과 / actor와 film_actor 사이를 left outer join한 테이블을 각각 연결하면 된다.
- '배우가 출현하지 않은 영화' = join한 테이블에서 actor_id 값이 null인 집합 찾기

In [13]:
%%sql

SELECT 
	F.FILM_ID,
	F.TITLE,
	F.RELEASE_YEAR,
	F.RENTAL_RATE,
	F.LENGTH
FROM
	FILM F
LEFT OUTER JOIN FILM_ACTOR FA ON
	F.FILM_ID = FA.FILM_ID
LEFT OUTER JOIN ACTOR A ON
	A.ACTOR_ID = FA.ACTOR_ID
WHERE
	A.ACTOR_ID IS NULL;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
3 rows affected.

[(803, 'Slacker Liaisons', 2006, Decimal('4.99'), 179),
 (323, 'Flight Lies', 2006, Decimal('4.99'), 179),
 (257, 'Drumline Cyclone', 2006, Decimal('0.99'), 110)]

# 문제 8.
>문제8번 store 상점 id별 주소 (address, address2, district) 와 해당 상점이 위치한 city 주소를 출력하시오. 	

- 상점 id별 주소 (address, address2, distict) 는 store 테이블
- store 테이블과 city 테이블은 address테이블로 연결 가능.
- address는
    - address_id로 store 테이블과 연결가능
    - city_id로 city 테이블과 연결 가능

In [14]:
%%sql

SELECT 
	S.STORE_ID,
	A.ADDRESS,
	A.ADDRESS2,
	A.DISTRICT,
	C.CITY
FROM
	STORE S
LEFT OUTER JOIN ADDRESS A ON
	S.ADDRESS_ID = A.ADDRESS_ID
LEFT OUTER JOIN CITY C ON
	C.CITY_ID = A.CITY_ID;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
2 rows affected.

[(1, '47 MySakila Drive', None, 'Alberta', 'Lethbridge'),
 (2, '28 MySQL Boulevard', None, 'QLD', 'Woodridge')]

# 문제 9. 
>문제9번 고객의 id 별로 고객의 이름 (first_name, last_name), 이메일, 고객의 주소 (address, district), phone번호, city, country 를 출력하시오. 	

- customer 테이블에 customer_id, first_name, last_name, email
- address 테이블에 address, district, phone
- city 테이블에 city
- country 테이블에 country

- address는
    - city 테이블과 cidy_id로 join할 수 있다.
    - customer 테이블과 address_id로 join할 수 있다.

In [15]:
%%sql

SELECT 
	C.CUSTOMER_ID,
	C.FIRST_NAME || ' ' || C.LAST_NAME AS CUSTOMER_NAME,
	C.EMAIL,
	A.ADDRESS,
	A.DISTRICT,
	A.PHONE,
	CT.CITY,
	CTY.COUNTRY
FROM
	CUSTOMER C
JOIN ADDRESS A ON
	C.ADDRESS_ID = A.ADDRESS_ID
JOIN CITY CT ON
	A.CITY_ID = CT.CITY_ID
JOIN COUNTRY CTY ON
	CT.COUNTRY_ID = CTY.COUNTRY_ID
LIMIT 10;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
10 rows affected.

[(1, 'Mary Smith', 'mary.smith@sakilacustomer.org', '1913 Hanoi Way', 'Nagasaki', '28303384290', 'Sasebo', 'Japan'),
 (2, 'Patricia Johnson', 'patricia.johnson@sakilacustomer.org', '1121 Loja Avenue', 'California', '838635286649', 'San Bernardino', 'United States'),
 (3, 'Linda Williams', 'linda.williams@sakilacustomer.org', '692 Joliet Street', 'Attika', '448477190408', 'Athenai', 'Greece'),
 (4, 'Barbara Jones', 'barbara.jones@sakilacustomer.org', '1566 Inegl Manor', 'Mandalay', '705814003527', 'Myingyan', 'Myanmar'),
 (5, 'Elizabeth Brown', 'elizabeth.brown@sakilacustomer.org', '53 Idfu Parkway', 'Nantou', '10655648674', 'Nantou', 'Taiwan'),
 (6, 'Jennifer Davis', 'jennifer.davis@sakilacustomer.org', '1795 Santiago de Compostela Way', 'Texas', '860452626434', 'Laredo', 'United States'),
 (7, 'Maria Miller', 'maria.miller@sakilacustomer.org', '900 Santiago de Compostela Parkway', 'Central Serbia', '716571220373', 'Kragujevac', 'Yugoslavia'),
 (8, 'Susan Wilson', 'susan.wilson@sakilacustomer.org', '478 Joliet Way', 'Hamilton', '657282285970', 'Hamilton', 'New Zealand'),
 (9, 'Margaret Moore', 'margaret.moore@sakilacustomer.org', '613 Korolev Drive', 'Masqat', '380657522649', 'Masqat', 'Oman'),
 (10, 'Dorothy Taylor', 'dorothy.taylor@sakilacustomer.org', '1531 Sal Drive', 'Esfahan', '648856936185', 'Esfahan', 'Iran')]

# 문제 10.
>문제10번 country 가 china 가 아닌 지역에 사는, 고객의 이름(first_name, last_name)과 , email, phonenumber, country, city 를 출력하시오.

- country는 country 테이블에 있다.
- 고객명, email은 customer 테이블에 있다.
- phonenumber(=phone)은 address 테이블에 있다.
- city는 city 테이블에 있다.

- 총 4개의 테이블을 join해야 한다.
- customer은 address_id로 address와 join할 수 있다.
- city는 address와 city_id로 join할 수 있다.
- country는 city와 country_id로 join할 수 있다.

In [16]:
%%sql

SELECT
	C.FIRST_NAME || ' ' || C.LAST_NAME AS CUSTOMER_NAME,
	C.EMAIL,
	A.PHONE,
	CTY.COUNTRY,
	CT.CITY
FROM
	CUSTOMER C
JOIN ADDRESS A ON
	C.ADDRESS_ID = A.ADDRESS_ID
JOIN CITY CT ON
	CT.CITY_ID = A.CITY_ID
JOIN COUNTRY CTY ON
	CTY.COUNTRY_ID = CT.COUNTRY_ID
WHERE
	CTY.COUNTRY NOT IN ('CHINA')
LIMIT 5;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[('Mary Smith', 'mary.smith@sakilacustomer.org', '28303384290', 'Japan', 'Sasebo'),
 ('Patricia Johnson', 'patricia.johnson@sakilacustomer.org', '838635286649', 'United States', 'San Bernardino'),
 ('Linda Williams', 'linda.williams@sakilacustomer.org', '448477190408', 'Greece', 'Athenai'),
 ('Barbara Jones', 'barbara.jones@sakilacustomer.org', '705814003527', 'Myanmar', 'Myingyan'),
 ('Elizabeth Brown', 'elizabeth.brown@sakilacustomer.org', '10655648674', 'Taiwan', 'Nantou')]

# 문제 11.
>문제11번 Horror 카테고리 장르에 해당하는 영화의 이름과 description 에 대해서 출력하시오 	

- 영화 이름(title), description은 film 테이블에 있다.
- 카테고리는 category 테이블에 있다.

- film_category 테이블로 film과 category 테이블을 join할 수 있다.
    - film_category 테이블과 film 테이블은 film_id 컬럼으로 join할 수 있다.
    - film_category 테이블과 category 테이블은 category_id 컬럼으로 join할 수 있다.
    
- 장르명은 category 테이블의 Name 컬럼에 있다.

In [17]:
%%sql

SELECT
	F.TITLE,
	F.DESCRIPTION,
    C.NAME
FROM
	FILM F
JOIN FILM_CATEGORY FC ON
	F.FILM_ID = FC.FILM_ID
JOIN CATEGORY C ON
	C.CATEGORY_ID = FC.CATEGORY_ID
WHERE
	C.NAME = 'Horror'
LIMIT 5;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[('Ace Goldfinger', 'A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China', 'Horror'),
 ('Affair Prejudice', 'A Fanciful Documentary of a Frisbee And a Lumberjack who must Chase a Monkey in A Shark Tank', 'Horror'),
 ('Airport Pollock', 'A Epic Tale of a Moose And a Girl who must Confront a Monkey in Ancient India', 'Horror'),
 ('Alabama Devil', 'A Thoughtful Panorama of a Database Administrator And a Mad Scientist who must Outgun a Mad Scientist in A Jet Boat', 'Horror'),
 ('Ali Forever', 'A Action-Packed Drama of a Dentist And a Crocodile who must Battle a Feminist in The Canadian Rockies', 'Horror')]

# 문제 12. 
>문제12번 Music 장르이면서, 영화길이가 60~180분 사이에 해당하는 영화의 title, description, length 를 출력하시오.
(영화 길이가 짧은 순으로 정렬해서 출력하시오.)

- 장르명은 category 테이블에 있다.
- 영화길이(length), title, description은 film테이블에 있다.
- film_category 테이블로 film과 category 테이블을 join할 수 있다.
    - film_category 테이블과 film 테이블은 film_id 컬럼으로 join할 수 있다.
    - film_category 테이블과 category 테이블은 category_id 컬럼으로 join할 수 있다.

In [18]:
%%sql

SELECT
	F.TITLE,
	F.DESCRIPTION,
	F.LENGTH,
    C.NAME
FROM
	FILM F
JOIN FILM_CATEGORY FC 
ON
	F.FILM_ID = FC.FILM_ID
JOIN CATEGORY C 
ON
	FC.CATEGORY_ID = C.CATEGORY_ID
WHERE
	F.LENGTH BETWEEN 60 AND 180
	AND C.NAME = 'Music'
ORDER BY
	F.LENGTH
LIMIT 5;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[('Taxi Kick', 'A Amazing Epistle of a Girl And a Woman who must Outrace a Waitress in Soviet Georgia', 64, 'Music'),
 ('Silence Kane', 'A Emotional Drama of a Sumo Wrestler And a Dentist who must Confront a Sumo Wrestler in A Baloon', 67, 'Music'),
 ('Clue Grail', 'A Taut Tale of a Butler And a Mad Scientist who must Build a Crocodile in Ancient China', 70, 'Music'),
 ('Rebel Airport', 'A Intrepid Yarn of a Database Administrator And a Boat who must Outrace a Husband in Ancient India', 73, 'Music'),
 ('Balloon Homeward', 'A Insightful Panorama of a Forensic Psychologist And a Mad Cow who must Build a Mad Scientist in The First Manned Space Station', 75, 'Music')]

# 문제 13.
>문제13번 actor 테이블을 이용하여,  배우의 ID, 이름, 성 컬럼에 추가로    'Angels Life' 영화에 나온 영화 배우 여부를 Y , N 으로 컬럼을 추가 표기해주세요.  해당 컬럼은 angelslife_flag로 만들어주세요.	   

- 영화 제목은 film 테이블의 title에 있다.
- Y, N은 case문으로 만들 수 있다.

- 전체 배우명이 나온 테이블에서 각 배우가 지정된 영화에 출연했는지 여부를 표시하는 컬럼이 우측에 concat 되어야 한다.

1) 중심 데이터 셋이될 ACTOR 테이블에서 필요한 집합을 출력한다.

In [19]:
%%sql

SELECT 
	A.ACTOR_ID ,
	A.FIRST_NAME || ' ' || A.LAST_NAME AS ACTOR_NAME
FROM
	ACTOR A

LIMIT 5;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[(1, 'Penelope Guiness'),
 (2, 'Nick Wahlberg'),
 (3, 'Ed Chase'),
 (4, 'Jennifer Davis'),
 (5, 'Johnny Lollobrigida')]

2) 각 영화 배우별로 영화촬영한 내역을 검색
- 전체 배우에 대한 데이터(actor) 가 반드시 포함되면서, 영화 촬영내역(actor_id, film_id, last_update) 포함 이 전제조건
- 기준 테이블인 actor 테이블의 데이터가 모두 나와야 하고, 영화 및 배우에 대한 정보(film_actor)이 모두 나와야 한다.
    - 따라서 left outer join을 해야 한다.

In [20]:
%%sql

select 
	A.ACTOR_ID ,
	A.FIRST_NAME || ' ' || A.LAST_NAME as ACTOR_NAME,
	FA.*
from
	ACTOR A
left outer join FILM_ACTOR FA 
on
    A.ACTOR_ID = FA.ACTOR_ID 
LIMIT 20;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
20 rows affected.

[(1, 'Penelope Guiness', 1, 1, datetime.datetime(2006, 2, 15, 10, 5, 3)),
 (1, 'Penelope Guiness', 1, 23, datetime.datetime(2006, 2, 15, 10, 5, 3)),
 (1, 'Penelope Guiness', 1, 25, datetime.datetime(2006, 2, 15, 10, 5, 3)),
 (1, 'Penelope Guiness', 1, 106, datetime.datetime(2006, 2, 15, 10, 5, 3)),
 (1, 'Penelope Guiness', 1, 140, datetime.datetime(2006, 2, 15, 10, 5, 3)),
 (1, 'Penelope Guiness', 1, 166, datetime.datetime(2006, 2, 15, 10, 5, 3)),
 (1, 'Penelope Guiness', 1, 277, datetime.datetime(2006, 2, 15, 10, 5, 3)),
 (1, 'Penelope Guiness', 1, 361, datetime.datetime(2006, 2, 15, 10, 5, 3)),
 (1, 'Penelope Guiness', 1, 438, datetime.datetime(2006, 2, 15, 10, 5, 3)),
 (1, 'Penelope Guiness', 1, 499, datetime.datetime(2006, 2, 15, 10, 5, 3)),
 (1, 'Penelope Guiness', 1, 506, datetime.datetime(2006, 2, 15, 10, 5, 3)),
 (1, 'Penelope Guiness', 1, 509, datetime.datetime(2006, 2, 15, 10, 5, 3)),
 (1, 'Penelope Guiness', 1, 605, datetime.datetime(2006, 2, 15, 10, 5, 3)),
 (1, 'Penelope Guiness', 1, 635, datetime.datetime(2006, 2, 15, 10, 5, 3)),
 (1, 'Penelope Guiness', 1, 749, datetime.datetime(2006, 2, 15, 10, 5, 3)),
 (1, 'Penelope Guiness', 1, 832, datetime.datetime(2006, 2, 15, 10, 5, 3)),
 (1, 'Penelope Guiness', 1, 939, datetime.datetime(2006, 2, 15, 10, 5, 3)),
 (1, 'Penelope Guiness', 1, 970, datetime.datetime(2006, 2, 15, 10, 5, 3)),
 (1, 'Penelope Guiness', 1, 980, datetime.datetime(2006, 2, 15, 10, 5, 3)),
 (2, 'Nick Wahlberg', 2, 3, datetime.datetime(2006, 2, 15, 10, 5, 3))]

- 한 배우가 여러 영화에 출연을 하다보니 actor_name & actor_id가 중복되어 자료의 양이 방대하다.

---

3) 2)번까지 작성한 테이블을 기준으로 'Angels Life' 라는 영화에 나온 배우들에 대한 데이터 집합을 출력하기

- 영화 제목이 Angels Life인 영화의 film_id 확인

In [21]:
%%sql

SELECT
	TITLE,
	FILM_ID
FROM
	FILM F
WHERE
	TITLE = 'Angels Life';

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
1 rows affected.

[('Angels Life', 25)]

영화 제목이 Angels Life인 영화에 출연한 배우 확인

In [22]:
%%sql

SELECT
	F.TITLE,
	F.FILM_ID,
	FA.ACTOR_ID
FROM
	FILM F
JOIN FILM_ACTOR FA 
	ON
	FA.FILM_ID = F.FILM_ID
WHERE
	TITLE = 'Angels Life';

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
9 rows affected.

[('Angels Life', 25, 1),
 ('Angels Life', 25, 4),
 ('Angels Life', 25, 7),
 ('Angels Life', 25, 47),
 ('Angels Life', 25, 91),
 ('Angels Life', 25, 136),
 ('Angels Life', 25, 166),
 ('Angels Life', 25, 167),
 ('Angels Life', 25, 187)]

Angels Life에 출연했던 배우들의 actor_id

1,4,7,47,91,136,166,167,187

4) actor 테이블을 기준으로 하여 Angels Life에 출연한 배우들의 정보를 추려내기

In [23]:
%%sql

select
	a.actor_id,
	a.first_name || ' ' || a.last_name as actor_name,
     
from
	actor a
	-- actor 테이블은 아래의 left outer join으로 인해 중복이 발생지 않게 된다.
	left outer join(
		-- 하나의 필름에 출연하는 배우에 데이터는 중복값이 없다.
		select
				F.TITLE,
				F.FILM_ID,
				FA.ACTOR_ID
		from
				FILM F
		join FILM_ACTOR FA 
			on
				FA.FILM_ID = F.FILM_ID
		where
				TITLE = 'Angels Life'
			) as angels_actor
		on
			a.actor_id = angels_actor.actor_id;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
(psycopg2.errors.SyntaxError) syntax error at or near "from"
LINE 5: from
        ^

[SQL: select
	a.actor_id,
	a.first_name || ' ' || a.last_name as actor_name,

from
	actor a
	-- actor 테이블은 아래의 left outer join으로 인해 중복이 발생지 않게 된다.
	left outer join(
		-- 하나의 필름에 출연하는 배우에 데이터는 중복값이 없다.
		select
				F.TITLE,
				F.FILM_ID,
				FA.ACTOR_ID
		from
				FILM F
		join FILM_ACTOR FA
			on
				FA.FILM_ID = F.FILM_ID
		where
				TITLE = 'Angels Life'
			) as angels_actor
		on
			a.actor_id = angels_actor.actor_id;]
(Background on this error at: http://sqlalche.me/e/13/f405)

- Angels Life에 출여한 배우들의 actor_id만 None값이 아니다.
- 즉, actor_id_1에 값이 None(=NULL) 인 actor_id는 Angels Life 영화에 출연하지 않은 것이다. (이를 응용해 case문으로 활용 가능)

5) 정답 풀이

In [24]:
%%sql

SELECT
	A.ACTOR_ID,
	A.FIRST_NAME || ' ' || A.LAST_NAME AS ACTOR_NAME,
	ANGELS_ACTOR.ACTOR_ID,
	CASE
		WHEN ANGELS_ACTOR.ACTOR_ID IS NOT NULL
		THEN 'Y'
		ELSE 'N'
	END AS angelslife_flag
FROM
	ACTOR A
	-- ACTOR 테이블은 아래의 LEFT OUTER JOIN으로 인해 중복이 발생지 않게 된다.
LEFT OUTER JOIN(
	-- 하나의 필름에 출연하는 배우에 데이터는 중복값이 없다.
	SELECT
				F.TITLE,
				F.FILM_ID,
				FA.ACTOR_ID
	FROM
				FILM F
	JOIN FILM_ACTOR FA 
			ON
				FA.FILM_ID = F.FILM_ID
	WHERE
				TITLE = 'Angels Life'
			) AS ANGELS_ACTOR
		ON
			A.ACTOR_ID = ANGELS_ACTOR.ACTOR_ID;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
200 rows affected.

[(1, 'Penelope Guiness', 1, 'Y'),
 (2, 'Nick Wahlberg', None, 'N'),
 (3, 'Ed Chase', None, 'N'),
 (4, 'Jennifer Davis', 4, 'Y'),
 (5, 'Johnny Lollobrigida', None, 'N'),
 (6, 'Bette Nicholson', None, 'N'),
 (7, 'Grace Mostel', 7, 'Y'),
 (8, 'Matthew Johansson', None, 'N'),
 (9, 'Joe Swank', None, 'N'),
 (10, 'Christian Gable', None, 'N'),
 (11, 'Zero Cage', None, 'N'),
 (12, 'Karl Berry', None, 'N'),
 (13, 'Uma Wood', None, 'N'),
 (14, 'Vivien Bergen', None, 'N'),
 (15, 'Cuba Olivier', None, 'N'),
 (16, 'Fred Costner', None, 'N'),
 (17, 'Helen Voight', None, 'N'),
 (18, 'Dan Torn', None, 'N'),
 (19, 'Bob Fawcett', None, 'N'),
 (20, 'Lucille Tracy', None, 'N'),
 (21, 'Kirsten Paltrow', None, 'N'),
 (22, 'Elvis Marx', None, 'N'),
 (23, 'Sandra Kilmer', None, 'N'),
 (24, 'Cameron Streep', None, 'N'),
 (25, 'Kevin Bloom', None, 'N'),
 (26, 'Rip Crawford', None, 'N'),
 (27, 'Julia Mcqueen', None, 'N'),
 (28, 'Woody Hoffman', None, 'N'),
 (29, 'Alec Wayne', None, 'N'),
 (30, 'Sandra Peck', None, 'N'),
 (31, 'Sissy Sobieski', None, 'N'),
 (32, 'Tim Hackman', None, 'N'),
 (33, 'Milla Peck', None, 'N'),
 (34, 'Audrey Olivier', None, 'N'),
 (35, 'Judy Dean', None, 'N'),
 (36, 'Burt Dukakis', None, 'N'),
 (37, 'Val Bolger', None, 'N'),
 (38, 'Tom Mckellen', None, 'N'),
 (39, 'Goldie Brody', None, 'N'),
 (40, 'Johnny Cage', None, 'N'),
 (41, 'Jodie Degeneres', None, 'N'),
 (42, 'Tom Miranda', None, 'N'),
 (43, 'Kirk Jovovich', None, 'N'),
 (44, 'Nick Stallone', None, 'N'),
 (45, 'Reese Kilmer', None, 'N'),
 (46, 'Parker Goldberg', None, 'N'),
 (47, 'Julia Barrymore', 47, 'Y'),
 (48, 'Frances Day-Lewis', None, 'N'),
 (49, 'Anne Cronyn', None, 'N'),
 (50, 'Natalie Hopkins', None, 'N'),
 (51, 'Gary Phoenix', None, 'N'),
 (52, 'Carmen Hunt', None, 'N'),
 (53, 'Mena Temple', None, 'N'),
 (54, 'Penelope Pinkett', None, 'N'),
 (55, 'Fay Kilmer', None, 'N'),
 (56, 'Dan Harris', None, 'N'),
 (57, 'Jude Cruise', None, 'N'),
 (58, 'Christian Akroyd', None, 'N'),
 (59, 'Dustin Tautou', None, 'N'),
 (60, 'Henry Berry', None, 'N'),
 (61, 'Christian Neeson', None, 'N'),
 (62, 'Jayne Neeson', None, 'N'),
 (63, 'Cameron Wray', None, 'N'),
 (64, 'Ray Johansson', None, 'N'),
 (65, 'Angela Hudson', None, 'N'),
 (66, 'Mary Tandy', None, 'N'),
 (67, 'Jessica Bailey', None, 'N'),
 (68, 'Rip Winslet', None, 'N'),
 (69, 'Kenneth Paltrow', None, 'N'),
 (70, 'Michelle Mcconaughey', None, 'N'),
 (71, 'Adam Grant', None, 'N'),
 (72, 'Sean Williams', None, 'N'),
 (73, 'Gary Penn', None, 'N'),
 (74, 'Milla Keitel', None, 'N'),
 (75, 'Burt Posey', None, 'N'),
 (76, 'Angelina Astaire', None, 'N'),
 (77, 'Cary Mcconaughey', None, 'N'),
 (78, 'Groucho Sinatra', None, 'N'),
 (79, 'Mae Hoffman', None, 'N'),
 (80, 'Ralph Cruz', None, 'N'),
 (81, 'Scarlett Damon', None, 'N'),
 (82, 'Woody Jolie', None, 'N'),
 (83, 'Ben Willis', None, 'N'),
 (84, 'James Pitt', None, 'N'),
 (85, 'Minnie Zellweger', None, 'N'),
 (143, 'River Dean', None, 'N'),
 (86, 'Greg Chaplin', None, 'N'),
 (87, 'Spencer Peck', None, 'N'),
 (88, 'Kenneth Pesci', None, 'N'),
 (89, 'Charlize Dench', None, 'N'),
 (90, 'Sean Guiness', None, 'N'),
 (91, 'Christopher Berry', 91, 'Y'),
 (92, 'Kirsten Akroyd', None, 'N'),
 (93, 'Ellen Presley', None, 'N'),
 (94, 'Kenneth Torn', None, 'N'),
 (95, 'Daryl Wahlberg', None, 'N'),
 (96, 'Gene Willis', None, 'N'),
 (97, 'Meg Hawke', None, 'N'),
 (98, 'Chris Bridges', None, 'N'),
 (99, 'Jim Mostel', None, 'N'),
 (100, 'Spencer Depp', None, 'N'),
 (101, 'Susan Davis', None, 'N'),
 (102, 'Walter Torn', None, 'N'),
 (103, 'Matthew Leigh', None, 'N'),
 (104, 'Penelope Cronyn', None, 'N'),
 (105, 'Sidney Crowe', None, 'N'),
 (106, 'Groucho Dunst', None, 'N'),
 (107, 'Gina Degeneres', None, 'N'),
 (108, 'Warren Nolte', None, 'N'),
 (109, 'Sylvester Dern', None, 'N'),
 (110, 'Susan Davis', None, 'N'),
 (111, 'Cameron Zellweger', None, 'N'),
 (112, 'Russell Bacall', None, 'N'),
 (113, 'Morgan Hopkins', None, 'N'),
 (114, 'Morgan Mcdormand', None, 'N'),
 (115, 'Harrison Bale', None, 'N'),
 (116, 'Dan Streep', None, 'N'),
 (117, 'Renee Tracy', None, 'N'),
 (118, 'Cuba Allen', None, 'N'),
 (119, 'Warren Jackman', None, 'N'),
 (120, 'Penelope Monroe', None, 'N'),
 (121, 'Liza Bergman', None, 'N'),
 (122, 'Salma Nolte', None, 'N'),
 (123, 'Julianne Dench', None, 'N'),
 (124, 'Scarlett Bening', None, 'N'),
 (125, 'Albert Nolte', None, 'N'),
 (126, 'Frances Tomei', None, 'N'),
 (127, 'Kevin Garland', None, 'N'),
 (128, 'Cate Mcqueen', None, 'N'),
 (129, 'Daryl Crawford', None, 'N'),
 (130, 'Greta Keitel', None, 'N'),
 (131, 'Jane Jackman', None, 'N'),
 (132, 'Adam Hopper', None, 'N'),
 (133, 'Richard Penn', None, 'N'),
 (134, 'Gene Hopkins', None, 'N'),
 (135, 'Rita Reynolds', None, 'N'),
 (136, 'Ed Mansfield', 136, 'Y'),
 (137, 'Morgan Williams', None, 'N'),
 (138, 'Lucille Dee', None, 'N'),
 (139, 'Ewan Gooding', None, 'N'),
 (140, 'Whoopi Hurt', None, 'N'),
 (141, 'Cate Harris', None, 'N'),
 (142, 'Jada Ryder', None, 'N'),
 (144, 'Angela Witherspoon', None, 'N'),
 (145, 'Kim Allen', None, 'N'),
 (146, 'Albert Johansson', None, 'N'),
 (147, 'Fay Winslet', None, 'N'),
 (148, 'Emily Dee', None, 'N'),
 (149, 'Russell Temple', None, 'N'),
 (150, 'Jayne Nolte', None, 'N'),
 (151, 'Geoffrey Heston', None, 'N'),
 (152, 'Ben Harris', None, 'N'),
 (153, 'Minnie Kilmer', None, 'N'),
 (154, 'Meryl Gibson', None, 'N'),
 (155, 'Ian Tandy', None, 'N'),
 (156, 'Fay Wood', None, 'N'),
 (157, 'Greta Malden', None, 'N'),
 (158, 'Vivien Basinger', None, 'N'),
 (159, 'Laura Brody', None, 'N'),
 (160, 'Chris Depp', None, 'N'),
 (161, 'Harvey Hope', None, 'N'),
 (162, 'Oprah Kilmer', None, 'N'),
 (163, 'Christopher West', None, 'N'),
 (164, 'Humphrey Willis', None, 'N'),
 (165, 'Al Garland', None, 'N'),
 (166, 'Nick Degeneres', 166, 'Y'),
 (167, 'Laurence Bullock', 167, 'Y'),
 (168, 'Will Wilson', None, 'N'),
 (169, 'Kenneth Hoffman', None, 'N'),
 (170, 'Mena Hopper', None, 'N'),
 (171, 'Olympia Pfeiffer', None, 'N'),
 (172, 'Groucho Williams', None, 'N'),
 (173, 'Alan Dreyfuss', None, 'N'),
 (174, 'Michael Bening', None, 'N'),
 (175, 'William Hackman', None, 'N'),
 (176, 'Jon Chase', None, 'N'),
 (177, 'Gene Mckellen', None, 'N'),
 (178, 'Lisa Monroe', None, 'N'),
 (179, 'Ed Guiness', None, 'N'),
 (180, 'Jeff Silverstone', None, 'N'),
 (181, 'Matthew Carrey', None, 'N'),
 (182, 'Debbie Akroyd', None, 'N'),
 (183, 'Russell Close', None, 'N'),
 (184, 'Humphrey Garland', None, 'N'),
 (185, 'Michael Bolger', None, 'N'),
 (186, 'Julia Zellweger', None, 'N'),
 (187, 'Renee Ball', 187, 'Y'),
 (188, 'Rock Dukakis', None, 'N'),
 (189, 'Cuba Birch', None, 'N'),
 (190, 'Audrey Bailey', None, 'N'),
 (191, 'Gregory Gooding', None, 'N'),
 (192, 'John Suvari', None, 'N'),
 (193, 'Burt Temple', None, 'N'),
 (194, 'Meryl Allen', None, 'N'),
 (195, 'Jayne Silverstone', None, 'N'),
 (196, 'Bela Walken', None, 'N'),
 (197, 'Reese West', None, 'N'),
 (198, 'Mary Keitel', None, 'N'),
 (199, 'Julia Fawcett', None, 'N'),
 (200, 'Thora Temple', None, 'N')]

# 문제 14.
>문제14번 대여일자가 2005-06-01~ 14일에 해당하는 주문 중에서 , 직원의 이름(이름 성) = 'Mike Hillyer' 이거나  고객의 이름이 (이름 성) ='Gloria Cook'  에 해당 하는 rental 의 모든 정보를 출력하시오.
(추가로  직원이름과, 고객이름에 대해서도  fullname 으로 구성해서 출력하시오.)

- 대여일자(rental_date)는 rental 테이블에 있다.
- 직원 이름은 staff 테이블에 있다.
- 고객 이름은 customer 테이블에 있다.
- rental 테이블로 staff 테이블과 customer 테이블을 연결 시킬 수 있다.
    - staff 테이블은 staff_id 컬럼으로 join
    - customer 테이블은 customer_id 컬럼으로 join
    
    
- **customer 테이블과 staff 테이블은 NULL값이 없기 때문에 inner join을 하는 것과 left outer join을 하는 것에 차이가 없다.**

In [25]:
%%sql

SELECT 
	R.*, 
	C.FIRST_NAME || ' ' || C.LAST_NAME AS CUSTOMER_NAME,
	S.FIRST_NAME || ' ' || S.LAST_NAME AS STAFF_NAME
FROM
	RENTAL R
JOIN CUSTOMER C 
ON
	C.CUSTOMER_ID = R.CUSTOMER_ID
JOIN STAFF S 
ON
	S.STAFF_ID = R.STAFF_ID
WHERE
	DATE(R.RENTAL_DATE) BETWEEN '2005-06-01' AND '2005-06-14'
and 
S.FIRST_NAME || ' ' || S.LAST_NAME = 'Mike Hillyer'
or
C.FIRST_NAME || ' ' || C.LAST_NAME = 'Gloria Cook';

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
38 rows affected.

[(130, datetime.datetime(2005, 5, 25, 21, 21, 56), 3990, 56, datetime.datetime(2005, 5, 30, 22, 41, 56), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Jon Stephens'),
 (341, datetime.datetime(2005, 5, 27, 4, 1, 42), 4168, 56, datetime.datetime(2005, 6, 5, 8, 51, 42), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Mike Hillyer'),
 (496, datetime.datetime(2005, 5, 28, 0, 43, 41), 1785, 56, datetime.datetime(2005, 6, 4, 3, 56, 41), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Mike Hillyer'),
 (569, datetime.datetime(2005, 5, 28, 10, 12, 41), 4534, 56, datetime.datetime(2005, 6, 3, 10, 8, 41), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Jon Stephens'),
 (1159, datetime.datetime(2005, 6, 14, 22, 55, 13), 4395, 516, datetime.datetime(2005, 6, 17, 2, 11, 13), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Elmer Noe', 'Mike Hillyer'),
 (1161, datetime.datetime(2005, 6, 14, 23, 7, 8), 1690, 285, datetime.datetime(2005, 6, 21, 17, 12, 8), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Miriam Mckinney', 'Mike Hillyer'),
 (1162, datetime.datetime(2005, 6, 14, 23, 9, 38), 987, 310, datetime.datetime(2005, 6, 23, 22, 0, 38), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Daniel Cabral', 'Mike Hillyer'),
 (1163, datetime.datetime(2005, 6, 14, 23, 12, 46), 4209, 592, datetime.datetime(2005, 6, 23, 21, 53, 46), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Terrance Roush', 'Mike Hillyer'),
 (1164, datetime.datetime(2005, 6, 14, 23, 16, 26), 3691, 49, datetime.datetime(2005, 6, 16, 21, 0, 26), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Joyce Edwards', 'Mike Hillyer'),
 (1166, datetime.datetime(2005, 6, 14, 23, 17, 3), 2508, 46, datetime.datetime(2005, 6, 15, 20, 43, 3), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Catherine Campbell', 'Mike Hillyer'),
 (1168, datetime.datetime(2005, 6, 14, 23, 35, 9), 4368, 481, datetime.datetime(2005, 6, 19, 3, 20, 9), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Herman Devore', 'Mike Hillyer'),
 (1172, datetime.datetime(2005, 6, 14, 23, 54, 34), 2685, 306, datetime.datetime(2005, 6, 16, 2, 26, 34), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Charles Kowalski', 'Mike Hillyer'),
 (1795, datetime.datetime(2005, 6, 16, 20, 9, 1), 536, 56, datetime.datetime(2005, 6, 24, 17, 50, 1), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Jon Stephens'),
 (2140, datetime.datetime(2005, 6, 17, 21, 40, 29), 2395, 56, datetime.datetime(2005, 6, 19, 0, 42, 29), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Mike Hillyer'),
 (2485, datetime.datetime(2005, 6, 18, 21, 26, 3), 1562, 56, datetime.datetime(2005, 6, 21, 22, 9, 3), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Jon Stephens'),
 (2989, datetime.datetime(2005, 6, 20, 8, 59, 37), 1586, 56, datetime.datetime(2005, 6, 22, 3, 27, 37), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Jon Stephens'),
 (3718, datetime.datetime(2005, 7, 6, 10, 57, 56), 2624, 56, datetime.datetime(2005, 7, 12, 12, 54, 56), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Mike Hillyer'),
 (3771, datetime.datetime(2005, 7, 6, 13, 19, 34), 1373, 56, datetime.datetime(2005, 7, 10, 10, 27, 34), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Jon Stephens'),
 (4097, datetime.datetime(2005, 7, 7, 6, 10, 55), 2454, 56, datetime.datetime(2005, 7, 11, 2, 45, 55), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Mike Hillyer'),
 (4702, datetime.datetime(2005, 7, 8, 11, 41, 36), 2593, 56, datetime.datetime(2005, 7, 10, 6, 55, 36), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Mike Hillyer'),
 (5142, datetime.datetime(2005, 7, 9, 8, 5, 23), 369, 56, datetime.datetime(2005, 7, 13, 12, 37, 23), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Jon Stephens'),
 (7385, datetime.datetime(2005, 7, 27, 15, 49, 46), 2996, 56, datetime.datetime(2005, 7, 28, 13, 50, 46), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Jon Stephens'),
 (7696, datetime.datetime(2005, 7, 28, 3, 41, 35), 3463, 56, datetime.datetime(2005, 8, 6, 5, 48, 35), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Jon Stephens'),
 (7942, datetime.datetime(2005, 7, 28, 12, 49, 44), 1636, 56, datetime.datetime(2005, 7, 31, 18, 7, 44), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Jon Stephens'),
 (8285, datetime.datetime(2005, 7, 29, 2, 0, 18), 678, 56, datetime.datetime(2005, 8, 3, 20, 43, 18), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Jon Stephens'),
 (10356, datetime.datetime(2005, 8, 1, 5, 49, 17), 313, 56, datetime.datetime(2005, 8, 10, 5, 57, 17), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Mike Hillyer'),
 (10678, datetime.datetime(2005, 8, 1, 17, 26, 24), 4438, 56, datetime.datetime(2005, 8, 5, 22, 55, 24), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Mike Hillyer'),
 (10946, datetime.datetime(2005, 8, 2, 3, 20, 39), 4271, 56, datetime.datetime(2005, 8, 5, 2, 59, 39), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Mike Hillyer'),
 (11358, datetime.datetime(2005, 8, 2, 17, 45, 2), 2361, 56, datetime.datetime(2005, 8, 11, 18, 16, 2), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Mike Hillyer'),
 (11656, datetime.datetime(2005, 8, 17, 5, 11, 9), 1451, 56, datetime.datetime(2005, 8, 25, 7, 51, 9), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Mike Hillyer'),
 (12537, datetime.datetime(2005, 8, 18, 14, 6, 39), 57, 56, datetime.datetime(2005, 8, 25, 9, 36, 39), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Jon Stephens'),
 (12713, datetime.datetime(2005, 8, 18, 21, 7, 28), 1505, 56, datetime.datetime(2005, 8, 24, 17, 46, 28), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Mike Hillyer'),
 (13560, datetime.datetime(2005, 8, 20, 4, 17, 16), 820, 56, datetime.datetime(2005, 8, 28, 8, 38, 16), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Mike Hillyer'),
 (13769, datetime.datetime(2005, 8, 20, 11, 43, 52), 2868, 56, datetime.datetime(2005, 8, 28, 13, 19, 52), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Mike Hillyer'),
 (14291, datetime.datetime(2005, 8, 21, 7, 3, 5), 3988, 56, datetime.datetime(2005, 8, 26, 12, 56, 5), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Jon Stephens'),
 (14534, datetime.datetime(2005, 8, 21, 15, 16, 29), 2514, 56, datetime.datetime(2005, 8, 26, 16, 18, 29), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Mike Hillyer'),
 (15702, datetime.datetime(2005, 8, 23, 10, 23, 28), 1602, 56, datetime.datetime(2005, 8, 29, 11, 8, 28), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Jon Stephens'),
 (15714, datetime.datetime(2006, 2, 14, 15, 16, 3), 2083, 56, None, 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gloria Cook', 'Mike Hillyer')]

# 문제 15.
>문제15번 대여일자가 2005-06-01~ 14일에 해당하는 주문 중에서 , 직원의 이름(이름 성) = 'Mike Hillyer' 에 해당 하는 직원에게  구매하지 않은  rental 의 모든 정보를 출력하시오.
(추가로  직원이름과, 고객이름에 대해서도  fullname 으로 구성해서 출력하시오.)

- 직원의 이름(이름 성) = 'Mike Hillyer' 에 해당 하는 직원에게  구매하지 않은 에 대한 조건만 수정하면 된다.

In [26]:
%%sql

SELECT 
	R.*, 
	C.FIRST_NAME || ' ' || C.LAST_NAME AS CUSTOMER_NAME,
	S.FIRST_NAME || ' ' || S.LAST_NAME AS STAFF_NAME
FROM
	RENTAL R
left outer JOIN CUSTOMER C 
ON
	C.CUSTOMER_ID = R.CUSTOMER_ID
JOIN STAFF S 
ON
	S.STAFF_ID = R.STAFF_ID
WHERE
	DATE(R.RENTAL_DATE) BETWEEN '2005-06-01' AND '2005-06-14'
AND
S.FIRST_NAME || ' ' || S.LAST_NAME NOT IN ('Mike Hillyer');

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
8 rows affected.

[(1158, datetime.datetime(2005, 6, 14, 22, 53, 33), 1632, 416, datetime.datetime(2005, 6, 18, 21, 37, 33), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Jeffery Pinson', 'Jon Stephens'),
 (1160, datetime.datetime(2005, 6, 14, 23, 0, 34), 2795, 239, datetime.datetime(2005, 6, 18, 1, 58, 34), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Minnie Romero', 'Jon Stephens'),
 (1165, datetime.datetime(2005, 6, 14, 23, 16, 27), 2855, 264, datetime.datetime(2005, 6, 20, 2, 40, 27), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Gwendolyn May', 'Jon Stephens'),
 (1167, datetime.datetime(2005, 6, 14, 23, 25, 58), 4021, 323, datetime.datetime(2005, 6, 18, 5, 18, 58), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Matthew Mahan', 'Jon Stephens'),
 (1169, datetime.datetime(2005, 6, 14, 23, 42, 56), 1062, 139, datetime.datetime(2005, 6, 16, 4, 2, 56), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Amber Dixon', 'Jon Stephens'),
 (1170, datetime.datetime(2005, 6, 14, 23, 47, 35), 2444, 595, datetime.datetime(2005, 6, 17, 5, 28, 35), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Terrence Gunderson', 'Jon Stephens'),
 (1171, datetime.datetime(2005, 6, 14, 23, 50, 11), 4082, 284, datetime.datetime(2005, 6, 17, 21, 44, 11), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Sonia Gregory', 'Jon Stephens'),
 (1173, datetime.datetime(2005, 6, 14, 23, 54, 46), 1050, 191, datetime.datetime(2005, 6, 19, 23, 26, 46), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 'Jeanette Greene', 'Jon Stephens')]